# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону (т.е. не 
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 
# 4, -2, 10, 2, 0, -9, 8, 10, -9, 
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

spisok = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_diap = int(input('минимум: '))
max_diap = int(input('максимум: '))
otvet = [i for i in range(len(spisok) - 1) if spisok[i] in range(min_diap, max_diap + 1)]
print(otvet)

# for i in range(len(spisok)):
#     if min_diap <= spisok[i] <= max_diap:
#         print(i)